
GAME_MAP = {
    (0, 0): "연대앞 버스정류장",
    (1, 0): "정문",
    (2, 0): "스타벅스",
    (3, 0): "세브란스병원 버스정류장",

    (0, -1): "공학원",
    (1, -1): "백양로1",
    (2, -1): "공터1",
    (3, -1): "암병원",
    (4, -1): "의과대학",

    (0, -2): "공학관",
    (1, -2): "백양로2",
    (2, -2): "백주년기념관",
    (3, -2): "안과병원",
    (4, -2): "제중관",

    (0, -3): "체육관",
    (1, -3): "백양로3",
    (2, -3): "공터2",
    (3, -3): "광혜원",
    (4, -3): "어린이병원",
    (5, -3): "세브란스병원",

    (0, -4): "중앙도서관",
    (1, -4): "독수리상",
    (2, -4): "학생회관",
    (3, -4): "루스채플",
    (4, -4): "재활병원",
    (5, -4): "치과대학",

    (0, -5): "백양관",
    (1, -5): "백양로5",
    (2, -5): "대강당",
    (3, -5): "음악관",
    (4, -5): "알렌관",
    (5, -5): "ABMRC",

    (4, -6): "새천년관",
    (5, -6): "이윤재관",
}

def get_place_name(x, y):
    return GAME_MAP.get((x, y), "알 수 없는 장소")


def move_player(game_map, x, y, direction):
        if direction == "북":
            new_x, new_y = x, y - 1
        elif direction == "남":
            new_x, new_y = x, y + 1
        elif direction == "서":
            new_x, new_y = x - 1, y
        elif direction == "동": 
            new_x, new_y = x + 1, y
        else:
            print("잘못된 방향입니다. 다시 시도하세요.")
            return x, y, False      
        if (new_x, new_y) in game_map:
            return new_x, new_y, True
        else:        
            return x, y, False 

